<!-- dflook/terraform-github-actions {"workspace":"default","backend_type":"s3","backend":"bb4d46fabe5ea312f3f37e5108f46dbec6b9c8e2fac373432748840f73ef6e60","plan_job_ref":"Job PR on main #27 at https://github.com/softkitit/softkit-nestjs-boilerplate/actions/runs/9043562519","plan_out_hash":"cea497eb853154fb003d5a696849de5b58a61e20b8d04dbcd569a41432b5fdee","plan_hash":"d80e84b72923e1fe9be0d526d095789a8bef26c9e7f9fee7005fcad117ee68bd","plan_text_format":"diff","version":"1.42.0"} -->
Terraform plan in __apps/platform/terraform/__
With backend config files: `apps/platform/terraform/backends/prod.s3.tfbackend`
With var files: `apps/platform/terraform/vars/prod.tfvars`
<details>
<summary>Plan: 1 to add, 0 to change, 1 to destroy.</summary>

```diff
Terraform used the selected providers to generate the following execution
plan. Resource actions are indicated with the following symbols:
-/+ destroy and then create replacement

Terraform will perform the following actions:

  # module.ecs-web-app.module.ecs_alb_service_task.aws_ecs_task_definition.default[0] must be replaced
-/+ resource "aws_ecs_task_definition" "default" {
!~      arn                      = "arn:aws:ecs:eu-central-1:381491873946:task-definition/softkit-nestjs-boilerplate-prod-platform:7" -> (known after apply)
!~      arn_without_revision     = "arn:aws:ecs:eu-central-1:381491873946:task-definition/softkit-nestjs-boilerplate-prod-platform" -> (known after apply)
!~      container_definitions    = (sensitive value) # forces replacement
!~      id                       = "****************************************" -> (known after apply)
!~      revision                 = 7 -> (known after apply)
        tags                     = {
            "Environment" = "prod"
            "Name"        = "softkit-nestjs-boilerplate-prod-platform"
            "Namespace"   = "softkit-nestjs-boilerplate"
            "Project"     = "platform"
            "Repository"  = "softkit-nestjs-boilerplate"
        }
#        (11 unchanged attributes hidden)
    }

Plan: 1 to add, 0 to change, 1 to destroy.

Warning: Argument is deprecated

  with module.ecs-web-app.module.ecs_codepipeline.module.codebuild.aws_s3_bucket.cache_bucket,
  on /tmp/terraform-data-dir/modules/ecs-web-app.ecs_codepipeline.codebuild/main.tf line 11, in resource "aws_s3_bucket" "cache_bucket":
  11:   acl           = "private"

Use the aws_s3_bucket_acl resource instead

(and one more similar warning elsewhere)
```
</details>

:memo: Plan generated in [PR on main #27](https://github.com/softkitit/softkit-nestjs-boilerplate/actions/runs/9043562519)